void main(){
  void first(int a, int b) { print('$a $b'); }
  // No ERROR 
  void second(int a, [int b]) { print('$a $b'); }
  // ERROR ห้ามใช้ [] ผสมกับ {}" ในภาษา Dart คุณ ไม่สามารถ ประกาศตัวแปรแบบ Optional Positional [...] และ Named Parameter {...} พร้อมกันในฟังก์ชันเดียวได้ครับ คอมไพเลอร์จะงงว่าจะให้ส่งค่าแบบไหนกันแน่
  // [] คือ ไม่ส่งก็ได้ แต่ถ้าส่งต้องเรียงตามลำดับ
  // {} คือ ระบุชื่อตอนส่ง (เช่น b: 5)
  // เลือกใช้แบบใดแบบหนึ่งครับ อย่าใช้ปนกัน
  void third([int a = 1, int b = 2]) { print('$a $b'); }
  // No ERROR 
  void forth(int a, {required int b}) { print('$a $b'); }
  // No ERROR 
  void fifth([int a], {required int b}) { print('$a $b'); }
  // ERROR
  // "เรื่อง Null Safety (ความปลอดภัยค่าว่าง)" ประกาศ [int b] ซึ่ง [] แปลว่า "ส่งก็ได้ ไม่ส่งก็ได้"
  // ถ้าคนเรียกใช้ฟังก์ชัน ไม่ส่งค่า b มา ตัวแปร b จะมีค่าเป็น null (ว่างเปล่า)
  // ซึ่ง fifth ประกาศชนิดตัวแปรเป็น int (จำนวนเต็ม) เฉยๆ ซึ่งแปลว่า "ห้ามเป็น null เด็ดขาด"
  // มันเลยขัดแย้งกัน(ยอมให้ไม่ส่งค่าได้ แต่ตัวแปรห้ามว่าง)
  // วิธีแก้ (เลือกทางใดทางหนึ่ง):
  // กำหนดค่าเริ่มต้น: บอกไปเลยว่าถ้าไม่ส่งมา ให้เป็น 0 นะ [int b = 0]
  // ยอมให้เป็น Null: เติมเครื่องหมาย ? เพื่อบอกว่าตัวแปรนี้ว่างได้นะ [int? b]
}